//=============================================================================
//
// シーン遷移処理 [scene.h]
// Author : Takeo
//
//=============================================================================
#pragma once

#include "main.h"
//==========================
//定数
//==========================
enum EScene {
	SCENE_NONE = 0,//未設定
	SCENE_TITLE,//タイトル
	SCENE_GAME,//ゲーム
	SCENE_GAMEOVER,//ゲームオーバー
	SCENE_RANKING,//ランキング

	MAX_SCENE
};


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitScene();
void UninitScene();
void UpdateScene();
void DrawScene();

void SetScene(int nScene);//シーン切り替え
