//=============================================================================
//
// スコア表示処理 [score.h]
// Author : Takeo
//
//=============================================================================
#pragma once

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitScore();
void UninitScore();
void UpdateScore();
void DrawScore();

int GetScore();				// スコア取得
void AddScore(int nValue);	// スコア加算
